CSI API ETABS v1

# cGenDisplGetTypeOAPI Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetTypeOAPI(
    	string name,
    	ref int MyType
    )

    Function GetTypeOAPI (
    	name As String,
    	ByRef MyType As Integer
    ) As Integer

    Dim instance As cGenDispl
    Dim name As String
    Dim MyType As Integer
    Dim returnValue As Integer

    returnValue = instance.GetTypeOAPI(name,
    	MyType)

    int GetTypeOAPI(
    	String^ name,
    	int% MyType
    )

    abstract GetTypeOAPI :
            name : string *
            MyType : int byref -> int

#### Parameters

name

    Type: SystemString

MyType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cGenDispl Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com